FamilyInstanceKeeper.changeSymbolId(ElementId!System.Runtime.CompilerServices.IsConst)
In the case when the Family Symbol isn't saved in the element (for example BC)
the setSymbolId() method has to be overridden to ...{ return ERR_NOT_APPLICABLE; }

FamilyInstanceKeeper.getNewValueForStep(ParamStorage*)
@return Truss Length for Truss Element